** 2.3 因子
尽管可以用一个字符型向量来存储名义属性数据，但R提供了称为因子（factor）的专用数据结构来表示这种属性数据。
其实因子是向量的一个特例，它单独用来标识名义属性（或变量）。
另外，一些机器学习算法是用特别的程序来处理分类变量的，把分类变量编码为因子可以确保模型能够合理地处理这类数据。
要把字符型向量转换成因子，只需要应用factor（）函数。例如：
#+BEGIN_SRC R
gender<-factor(c("MALE","FAMALE","MALE"))
#+END_SRC

#+RESULTS:
| MALE   |
| FAMALE |
| MALE   |

#+BEGIN_SRC R
blood<-factor(c("O","AB","A"),
levels=c("A","B","AB","O"))
blood
#+END_SRC

#+RESULTS:
| O  |
| AB |
| A  |
*** 2.3.3 矩阵和数组
#+BEGIN_SRC R
m<-matrix(c("a","b","c","d"),nrow=2)
m
#+END_SRC

#+RESULTS:
| a | c |
| b | d |
#+BEGIN_SRC R
m<-matrix(c("a","b","c","d"),ncol=2)
m
#+END_SRC
你将会注意到R先加载矩阵的第一列，然后加载第二列。这称为按列顺序。为了进一步说明这个概念，观察当我们在矩阵中加入更多值以后会发生什么。

#+BEGIN_SRC R
m<-matrix(c("a","b","c","d","e","f"),nrow=2)
m
#+END_SRC
#+BEGIN_SRC R
m<-matrix(c("a","b","c","d","e","f"),ncol=2)
m
#+END_SRC
#+BEGIN_SRC R
m[1,]
m[,1]
#+END_SRC
与矩阵结构非常接近的是数组（array），它是一个多维数据表。一个矩阵含有行和列值；一个数组包含行、列以及任意多层的值。尽管在后面的章节中我们偶尔会使用矩阵，但是数组的使用就超出了本书的学习范围。
